zoom.org
* SSFT Zoom Details

May 23, 2026 08:00 AM Pacific Time (US and Canada)
Every day, until May 29, 2026, 7 occurrence(s)

https://us02web.zoom.us/meeting/tZcsc-CgqjwjHdwWEsD1cL_o3PpyFVR1IjEp/ics?icsToken=DNeLUMgMJDBU7NpbngAALAAAAIbsfe1p08Oe2nWzunJYHmHgoVTen41-CRTp_NjdU-BrVkJHP2oVIbTVVvjmDhKeNYa2CD9jVrHth_T0cjAwMDAwMQ&meetingMasterEventId=AdHAmaE0RLOoXissvyZQzQ

https://us02web.zoom.us/j/83149847978?pwd=yv3m7wf3Ip06JIXt5FEYw2IOzUYDaN.1

** [[https://us02web.zoom.us/launch/jc/83149847978][Meeting chat link]]

** Meeting ID: 831 4984 7978 (Passcode: 502505)

** [[https://us02web.zoom.us/meetings/83149847978/invitations?signature=1bHbST7lq-lN0GzkGVMO2lGaNSixBiBUIb-T5SUyqUg][Join Instructions]]
