zoom.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Generated from Org source -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Karthik Nukala" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<main id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org825b491">1. SSFT Zoom Details</a>
<ul>
<li><a href="#orga96ffa9">1.1. Meeting chat link</a></li>
<li><a href="#orgcfe8e64">1.2. Meeting ID: 831 4984 7978 (Passcode: 502505)</a></li>
<li><a href="#org6509d4c">1.3. Join Instructions</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org825b491" class="outline-2">
<h2 id="org825b491"><span class="section-number-2">1.</span> SSFT Zoom Details</h2>
<div class="outline-text-2" id="text-1">
<p>
May 23, 2026 08:00 AM Pacific Time (US and Canada)
Every day, until May 29, 2026, 7 occurrence(s)
</p>

<p>
<a href="https://us02web.zoom.us/meeting/tZcsc-CgqjwjHdwWEsD1cL_o3PpyFVR1IjEp/ics?icsToken=DNeLUMgMJDBU7NpbngAALAAAAIbsfe1p08Oe2nWzunJYHmHgoVTen41-CRTp_NjdU-BrVkJHP2oVIbTVVvjmDhKeNYa2CD9jVrHth_T0cjAwMDAwMQ&amp;meetingMasterEventId=AdHAmaE0RLOoXissvyZQzQ">https://us02web.zoom.us/meeting/tZcsc-CgqjwjHdwWEsD1cL_o3PpyFVR1IjEp/ics?icsToken=DNeLUMgMJDBU7NpbngAALAAAAIbsfe1p08Oe2nWzunJYHmHgoVTen41-CRTp_NjdU-BrVkJHP2oVIbTVVvjmDhKeNYa2CD9jVrHth_T0cjAwMDAwMQ&amp;meetingMasterEventId=AdHAmaE0RLOoXissvyZQzQ</a>
</p>

<p>
<a href="https://us02web.zoom.us/j/83149847978?pwd=yv3m7wf3Ip06JIXt5FEYw2IOzUYDaN.1">https://us02web.zoom.us/j/83149847978?pwd=yv3m7wf3Ip06JIXt5FEYw2IOzUYDaN.1</a>
</p>
</div>

<div id="outline-container-orga96ffa9" class="outline-3">
<h3 id="orga96ffa9"><span class="section-number-3">1.1.</span> <a href="https://us02web.zoom.us/launch/jc/83149847978">Meeting chat link</a></h3>
</div>

<div id="outline-container-orgcfe8e64" class="outline-3">
<h3 id="orgcfe8e64"><span class="section-number-3">1.2.</span> Meeting ID: 831 4984 7978 (Passcode: 502505)</h3>
</div>

<div id="outline-container-org6509d4c" class="outline-3">
<h3 id="org6509d4c"><span class="section-number-3">1.3.</span> <a href="https://us02web.zoom.us/meetings/83149847978/invitations?signature=1bHbST7lq-lN0GzkGVMO2lGaNSixBiBUIb-T5SUyqUg">Join Instructions</a></h3>
</div>
</div>
</main>
</body>
</html>
